PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc43xx/chip/lpc43_ccu.h
#define LPC43_CCU2_PM                       (LPC43_CCU2_BASE+LPC43_CCU2_PM_OFFSET)
#define LPC43_CCU2_BASE_STAT                (LPC43_CCU2_BASE+LPC43_CCU2_BASE_STAT_OFFSET)
#define LPC43_CCU2_APLL_CFG                 (LPC43_CCU2_BASE+LPC43_CCU2_APLL_CFG_OFFSET)
#define LPC43_CCU2_APLL_STAT                (LPC43_CCU2_BASE+LPC43_CCU2_APLL_STAT_OFFSET)
#define LPC43_CCU2_APB2_USART3_CFG          (LPC43_CCU2_BASE+LPC43_CCU2_APB2_USART3_CFG_OFFSET)
#define LPC43_CCU2_APB2_USART3_STAT         (LPC43_CCU2_BASE+LPC43_CCU2_APB2_USART3_STAT_OFFSET)
#define LPC43_CCU2_APB2_USART2_CFG          (LPC43_CCU2_BASE+LPC43_CCU2_APB2_USART2_CFG_OFFSET)
#define LPC43_CCU2_APB2_USART2_STAT         (LPC43_CCU2_BASE+LPC43_CCU2_APB2_USART2_STAT_OFFSET)
#define LPC43_CCU2_APB0_UART1_CFG           (LPC43_CCU2_BASE+LPC43_CCU2_APB0_UART1_CFG_OFFSET)
#define LPC43_CCU2_APB0_UART1_STAT          (LPC43_CCU2_BASE+LPC43_CCU2_APB0_UART1_STAT_OFFSET)
#define LPC43_CCU2_APB0_USART0_CFG          (LPC43_CCU2_BASE+LPC43_CCU2_APB0_USART0_CFG_OFFSET)
#define LPC43_CCU2_APB0_USART0_STAT         (LPC43_CCU2_BASE+LPC43_CCU2_APB0_USART0_STAT_OFFSET)
#define LPC43_CCU2_APB2_SSP1_CFG            (LPC43_CCU2_BASE+LPC43_CCU2_APB2_SSP1_CFG_OFFSET)
#define LPC43_CCU2_APB2_SSP1_STAT           (LPC43_CCU2_BASE+LPC43_CCU2_APB2_SSP1_STAT_OFFSET)
#define LPC43_CCU2_APB0_SSP0_CFG            (LPC43_CCU2_BASE+LPC43_CCU2_APB0_SSP0_CFG_OFFSET)
#define LPC43_CCU2_APB0_SSP0_STAT           (LPC43_CCU2_BASE+LPC43_CCU2_APB0_SSP0_STAT_OFFSET)
#define LPC43_CCU2_SDIO_CFG                 (LPC43_CCU2_BASE+LPC43_CCU2_SDIO_CFG_OFFSET)
#define LPC43_CCU2_SDIO_STAT                (LPC43_CCU2_BASE+LPC43_CCU2_SDIO_STAT_OFFSET)

/* Register Bit Definitions *************************************************************************/

/* CCU1/2 Power Mode Register */

#define CCU_PM_PD                           (1 << 0)  /* Bit 0: Initiate power-down mode */
                                                      /* Bits 1-31:  Reserved */
/* CCU1 Base Clock Status Register */

#define CCU1_BASE_STAT_AB3                  (1 << 0)  /* Bit 0:  Base clock indicator for BASE_APB3_CLK */
#define CCU1_BASE_STAT_APB1                 (1 << 1)  /* Bit 1:  Base clock indicator for BASE_APB1_CLK */
#define CCU1_BASE_STAT_SPIFI                (1 << 2)  /* Bit 2:  Base clock indicator for BASE_SPIFI_CLK */
#define CCU1_BASE_STAT_M4                   (1 << 3)  /* Bit 3:  Base clock indicator for BASE_M4_CLK */
                                                      /* Bits 4-5:  Reserved */
#define CCU1_BASE_STAT_PERIPH               (1 << 6)  /* Bit 6:  Base clock indicator for BASE_PERIPH_CLK */
#define CCU1_BASE_STAT_USB0                 (1 << 7)  /* Bit 7:  Base clock indicator for BASE_USB0_CLK */
#define CCU1_BASE_STAT_USB1                 (1 << 8)  /* Bit 8:  Base clock indicator for BASE_USB1_CLK */
#define CCU1_BASE_STAT_SPI                  (1 << 9)  /* Bit 9:  Base clock indicator for BASE_SPI_CLK */
                                                      /* Bits 10-31:  Reserved */
/* CCU2 Base Clock Status Register */
                                                      /* Bit 0:  Reserved */
#define CCU2_BASE_STAT_UART3                (1 << 1)  /* Bit 1:  Base clock indicator for BASE_UART3_CLK */
#define CCU2_BASE_STAT_UART2                (1 << 2)  /* Bit 2:  Base clock indicator for BASE_UART2_CLK */
#define CCU2_BASE_STAT_UART1                (1 << 3)  /* Bit 3:  Base clock indicator for BASE_UART1_CLK */
#define CCU2_BASE_STAT_UART0                (1 << 4)  /* Bit 4:  Base clock indicator for BASE_UART0_CLK */
#define CCU2_BASE_STAT_SSP1                 (1 << 5)  /* Bit 5:  Base clock indicator for BASE_SSP1_CLK */
#define CCU2_BASE_STAT_SSP0                 (1 << 6)  /* Bit 6:  Base clock indicator for BASE_SSP0_CLK */
                                                      /* Bits 7-31:  Reserved */
/* CCU1/2 Branch Clock Configuration/Status Registers */

#define CCU_CLK_CFG_RUN                     (1 << 0)  /* Bit 0:  Run enable */
#define CCU_CLK_CFG_AUTO                    (1 << 1)  /* Bit 1:  Auto (AHB disable mechanism) enable */
#define CCU_CLK_CFG_WAKEUP                  (1 << 2)  /* Bit 2:  Wake-up mechanism enable */
                                                      /* Bits 3-31:  Reserved */
/* CCU1/2 Branch Clock Status Registers */

#define CCU_CLK_STAT_RUN                    (1 << 0)  /* Bit 0:  Run enable status */
#define CCU_CLK_STAT_AUTO                   (1 << 1)  /* Bit 1:  Auto (AHB disable mechanism) enable status */
#define CCU_CLK_STAT_WAKEUP                 (1 << 2)  /* Bit 2:  Wake-up mechanism enable status */
                                                      /* Bits 3-31:  Reserved */

/****************************************************************************************************
 * Public Types
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Data
 ****************************************************************************************************/

/****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC43XX_CHIP_LPC43_CCU_H */
